{
  "id": "root",
  "text": "Eres un valiente caballero del Reino de Eldoria. El rey te encomienda una misión: recuperar la Espada de la Luz, robada por un antiguo dragón que habita en las Montañas Negras.",
  "options": [
    {
      "text": "Aceptar la misión y partir al amanecer",
      "nextNode": {
        "id": "bosque",
        "text": "Te adentras en el Bosque Sombrío, el camino más rápido, pero peligroso. De repente, escuchas ruidos entre los arbustos.",
        "options": [
          {
            "text": "Investigar el ruido",
            "nextNode": {
              "id": "ladron",
              "text": "Un ladrón intenta emboscarte. Logras derrotarlo, pero estás herido.",
              "options": [
                {
                  "text": "Buscar un curandero en un pueblo cercano",
                  "nextNode": {
                    "id": "curandero",
                    "text": "Un amable curandero te sana y te da una poción de fuerza. Prosigues más preparado.",
                    "options": [
                      {
                        "text": "Tomar la ruta de las cuevas para evitar el camino principal",
                        "nextNode": {
                          "id": "cuevas",
                          "text": "Dentro de la cueva, un grupo de trolls te embosca.",
                          "options": [
                            {
                              "text": "Usar la poción de fuerza para luchar",
                              "nextNode": {
                                "id": "tesoroTroll",
                                "text": "Venciste a los trolls y encuentras un mapa secreto en su tesoro. ¡Te acerca a la Espada de la Luz!",
                                "options": [
                                  {
                                    "text": "Seguir el mapa hacia la montaña del dragón",
                                    "nextNode": {
                                      "id": "montanaDragon",
                                      "text": "Llegas a la montaña y enfrentas al dragón en un combate épico.",
                                      "options": [
                                        {
                                          "text": "Usar la Espada de Fuego que tomaste del tesoro",
                                          "nextNode": {
                                            "id": "victoria",
                                            "text": "Derrotas al dragón con la Espada de Fuego. Recuperas la Espada de la Luz y regresas como un héroe. ¡Has salvado Eldoria!",
                                            "options": []
                                          }
                                        },
                                        {
                                          "text": "Enfrentarlo con tu espada normal",
                                          "nextNode": {
                                            "id": "derrotaFinal",
                                            "text": "El dragón es demasiado poderoso. Mueres con honor en la batalla. Tu nombre es recordado como un valiente.",
                                            "options": []
                                          }
                                        }
                                      ]
                                    }
                                  }
                                ]
                              }
                            },
                            {
                              "text": "Intentar huir",
                              "nextNode": {
                                "id": "huidaFallida",
                                "text": "Uno de los trolls te alcanza y acabas derrotado. Fin de tu aventura.",
                                "options": []
                              }
                            }
                          ]
                        }
                      },
                      {
                        "text": "Seguir el camino principal hacia la montaña",
                        "nextNode": {
                          "id": "caminoPrincipal",
                          "text": "El camino es largo pero seguro. Llegas al pie de la Montaña Negra, donde te espera una anciana sabia.",
                          "options": [
                            {
                              "text": "Hablar con la anciana",
                              "nextNode": {
                                "id": "profecia",
                                "text": "La anciana te revela una profecía: 'Solo quien tenga el corazón puro podrá blandir la Espada de la Luz'.",
                                "options": [
                                  {
                                    "text": "Aceptar tu destino y subir la montaña",
                                    "nextNode": {
                                      "id": "dragonFinalSabio",
                                      "text": "Al enfrentarte al dragón, la Espada de la Luz brilla desde su guarida y vuela hacia tus manos. Derrotas al dragón con su propio poder. ¡Eres el elegido!",
                                      "options": []
                                    }
                                  }
                                ]
                              }
                            },
                            {
                              "text": "Ignorarla y seguir solo",
                              "nextNode": {
                                "id": "dragonSinSabiduria",
                                "text": "Sin el conocimiento de la profecía, enfrentas al dragón sin preparación especial. Caíste en la batalla.",
                                "options": []
                              }
                            }
                          ]
                        }
                      }
                    ]
                  }
                },
                {
                  "text": "Continuar sin curarte",
                  "nextNode": {
                    "id": "puenteRoto",
                    "text": "Llegas a un viejo puente colgante que se rompe al cruzarlo. Caíste en un río helado y mueres de hipotermia.",
                    "options": []
                  }
                }
              ]
            }
          },
          {
            "text": "Ignorar el ruido y seguir adelante",
            "nextNode": {
              "id": "trampaLobos",
              "text": "Caes en una trampa de lobos salvajes y no sobrevives. Fin del viaje.",
              "options": []
            }
          }
        ]
      }
    },
    {
      "text": "Rechazar la misión",
      "nextNode": {
        "id": "rechazo",
        "text": "El rey se decepciona de ti. Vives una vida tranquila pero sin gloria. La Espada de la Luz se pierde para siempre.",
        "options": []
      }
    }
  ]
}
